{
    "id": -1,
    "title": "Inflipity",
    "authors": "Elliott Schultz, Haley Barnette, Alex Owens, Tommy Riga",
    "short_description": "A simple one button game where you control gravity as an alien in a space helmet runs for its life through a broken space station.",
    "long_description": "A simple one button game where you control gravity as an alien in a space helmet runs for its life through a broken space station.",
    "mechanics": "You control gravity by simply switching it between up and down, but every time you do, the alien speeds up. You can collect power-ups later to slow you down.",
    "aesthetics": "Our focus with the aesthetics of the game was to make it feel like you were dodging space debris (asteroids, broken beams, etc.). Most of the art was taken from free asset packs, but the alien art and sound were created by members of the team.",
    "background": "This game was created as a two week mini project for the Advanced Game Projects class. For some members of the team, this was their first game, so this was quick and fun introduction into the world of game design before the larger projects got under way.",
    "affiliation": "College of Engineering, Department of Computer Science, Concentration in Game Development",
    "biography": "As students in the Game Development Concentration, we strive to make games that are both fun to play and additive to the vast gaming community.",
    "genres": ["action"],
    "controls": "Space/Tap Screen: Flip Gravity",
    "supported_controllers": [1, 1, 0],
    "main_image": "./images/inflipity/inflipity.png",
    "images": [
        {
            "src": "./images/inflipity/start-screen.png",
            "alt": "Start screen of game"
        },
        {
            "src": "./images/inflipity/play-screen.png",
            "alt": "Play screen of game"
        },
        {
            "src": "./images/inflipity/spin.png",
            "alt": "Spinning obstacles"
        },
        {
            "src": "./images/inflipity/end-screen.png",
            "alt": "End screen of game"
        },
        {
            "src": "./images/inflipity/inflipity.png",
            "alt": "Logo of game"
        }
    ],
    "json_src": "./dist/jsons/inflipity.json",
    "game_src": "game_builds/inflipity/index.html",
    "date_published": "2024-01-01"
}