{
    "id": -1,
    "title": "Tron Brick Breaker",
    "authors": "Elliott Schultz",
    "short_description": "Classic Brick Breaker in the art style of Tron",
    "long_description": "Have you ever wondered what Brick Breaker would look like if it existed in the Tron universe? Regardless, this game takes the bright, neon aesthetic of Tron and couples it with the classic game of Brick Breaker.",
    "objective": "Move your paddle and bounce the ball to clear the screen of bricks.",
    "mechanics": "",
    "aesthetics": "While the Tron art style is simplistic, the neon lines and dark backgrounds give a unique look to a simple game, transforming the experience into something that feels more modern while keeping the retro gameplay.",
    "background": "This game was made as the final project for the Computer Graphics class where we learned about the complex systems that go into rendering 3D models on a 2D screen. Taking inspiration from the projects we had done previously in class, I created this game to showcase all I had learned in the class.",
    "affiliation": "College of Engineering, Department of Computer Science, Concentration in Game Development",
    "biography": "As a student in the Game Development Concentration, I strive to make games that are both fun to play and additive to the overall gaming community.",
    "genres": ["action", "survival", "casual"],
    "controls": "For keyboard, use the Left and Right arrow keys to move the paddle and use the Enter key to play/pause. For controller, use the Left Stick to move the paddle and the A button to play/pause.",
    "supported_controllers": [0, 1, 1],
    "main_image": "./images/tron-brick-breaker/logo.png",
    "images": [
        {
            "src": "./images/tron-brick-breaker/start-screen.png",
            "alt": "Start screen of the game"
        },
        {
            "src": "./images/tron-brick-breaker/play-screen.png",
            "alt": "Screen while playing game"
        },
        {
            "src": "./images/tron-brick-breaker/lose-screen.png",
            "alt": "Screen when you lose the game"
        },
        {
            "src": "./images/tron-brick-breaker/win-screen.png",
            "alt": "Screen when you win the game"
        },
        {
            "src": "./images/tron-brick-breaker/logo.png",
            "alt": "logo for the game"
        }
    ],
    "json_src": "./dist/jsons/tron_brick_breaker.json",
    "game_src": "game_builds/tron_brick_breaker/index.html",
    "date_published": "2022-12-04"
}