{
    "id": -1,
    "title": "Apimancer",
    "authors": "Adam Imbert, Alex Owens, Isaiah Che, Jackson Peck, Kai Machuca, Thomas Gelman, Trevor Stevens",
    "affiliation": "Computer Science Majors, Collegiate Partners at UNC School of the Arts",
    "biography": "The 'Bee Team' was formed as part of the Advanced Game Projects class in Spring '23. It is comprised of five Game Design concentration students from NCSU and two Sound Design students from UNCSA; Apimancer is the result of our semester-long effort to make a polished game experience!",
    "short_description": "Insect summoners duel to the death in turn-based tactical combat. Minion management tactics on a honeycomb grid!",
    "long_description": "The insect mage's guild is renowned across the lands for their skilled insect summoners, but becoming a member isn't easy. Summon magical bees to fight for you in a 1-on-1 duel with the guild's most powerful wizard to prove your might and join their ranks! Harvest Nectar, the source of your power, during combat to amass an army and take down the ant-wielding Myrmidonist.",
    "controls": "Left Click - Interact with map tiles & yellow wizard\nMiddle Click & Drag - Pan camera\nRight Click & Drag - Turn camera",
    "mechanics": "All ally units will act (move and attack) on their own turn, independent of the player. Units can be created and aided on the player's turn with Summons and Spells, which cost Nectar points to use. Nectar can be replenished with Worker Bees, who will harvest it from flowers on the map.",
    "aesthetics": "The game uses pixel art graphics evocative of early turn-based strategy games, combined with a 3-dimensional environment to give a sense of depth. Combat occurs on a hexagonal 'honeycomb' grid, keeping with the theme of bees and insects.",
    "background": "Ally units in Apimancer acting independently resulted in a great deal of time being spent designing the unit AI, ensuring that it was predictable enough to plan around while still being fun and chaotic. Programming the hexagonal grid was also a tricky balancing act of elegance and readability.",
    "genres": ["strategy"],
    "supported_controllers": [0, 1, 0],
    "main_image": "./images/apimancer/0hoM1F.png",
    "images": [
        {
            "src": "./images/apimancer/apimancer_ss1.png",
            "alt": "The Apimancer, with two worker bees at their side."
        },
        {
            "src": "./images/apimancer/apimancer_ss2.png",
            "alt": "The Myrmidonist summoning a fire ant to attack the incoming enemy units."
        },
        {
            "src": "./images/apimancer/apimancer_ss3.png",
            "alt": "The Apimancer casts Honey Trap on the enemy wizard, reducing their movement the following turn."
        }
    ],
    "json_src": "./dist/jsons/apimancer.json",
    "game_src": "game_builds/apimancer/index.html",
    "date_published": "2023-04-27"
}